[
  {
    "plantId": 1,
    "plantName": "Areca Palm",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "The Areca Palm, often called the Butterfly Palm, is a truly lush and elegant indoor plant that excels at purifying the air, actively removing common household toxins to promote a healthier living environment. Beyond its air-cleaning capabilities, it introduces a distinctly tropical, resort-like ambiance to any room it occupies. This beautiful palm thrives in bright, indirect sunlight, which encourages its vibrant green fronds to flourish. It requires minimal, yet consistent, watering—allowing the top inch of soil to dry out between sessions. The Areca Palm is celebrated for its ability to grow into a substantial, multi-stemmed plant, instantly adding height, drama, and a profound sense of calm and freshness to living rooms, sunrooms, or large office spaces. Its easy-care nature makes it a fantastic choice for both novice and experienced plant parents seeking a significant, low-maintenance statement piece.",
    "image": "https://i.postimg.cc/rFp5G08F/Large-Areca-Palm-For-Sale-Indoor-Elegance-by-easyplant-Photoroom.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Monstera Deliciosa",
    "category": "Tropical",
    "price": 35,
    "rating": 4.9,
    "availableStock": 8,
    "careLevel": "Moderate",
    "description": "The Monstera Deliciosa, famously nicknamed the Swiss Cheese Plant due to its iconic, naturally occurring holes and fenestrations, is a highly popular houseplant that adds a bold, unmistakable tropical, jungle-like touch to any indoor setting. Its large, glossy, and uniquely perforated leaves are the defining feature, bringing incredible life, texture, and architectural interest to interiors, quickly becoming a stunning focal point. This magnificent plant thrives best in bright, indirect light, which is crucial for encouraging its dramatic leaf splitting. It prefers a well-draining soil mix and consistent moisture, though it should be allowed to dry slightly between waterings. As a climbing vine in its natural habitat, providing a moss pole or support structure will encourage larger leaf growth and an upright, impressive form. The Monstera is a fast-growing, rewarding plant for those who appreciate dramatic foliage and a vibrant, green aesthetic.",
    "image": "https://i.postimg.cc/9MWDWKMv/rooftop-gardens-restaurant-norwich-Photoroom.png",
    "providerName": "GreenHaven"
  },
  {
    "plantId": 3,
    "plantName": "Fiddle Leaf Fig",
    "category": "Decorative",
    "price": 60,
    "rating": 4.7,
    "availableStock": 5,
    "careLevel": "Moderate",
    "description": "The Fiddle Leaf Fig (*Ficus lyrata*) is a quintessential, high-impact indoor tree that has dominated interior design trends for its unmatched ability to elevate home decor instantly. Characterized by its enormous, distinctively violin-shaped leaves that are thick, dark green, and glossy, it serves as a powerful, sculptural statement piece in any room. To thrive and maintain its spectacular foliage, it absolutely prefers a position with bright, filtered sunlight—near a sunny, sheer-curtained window is ideal. The Fiddle Leaf Fig requires a careful, consistent watering routine, needing a deep soak once the top few inches of soil are dry, but it is sensitive to both over- and underwatering. When placed thoughtfully in a well-lit corner, this plant provides a modern, chic, and organic element, transforming a simple space into a sophisticated sanctuary. Its impressive vertical growth adds a sense of permanence and maturity to your interior landscape.",
    "image": "https://i.postimg.cc/bwkr1pSV/Fiddle-Leaf-Fig-Houseplants-Medium-7-to-12-tall-Grant-The-Sill-Photoroom.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 4,
    "plantName": "ZZ Plant",
    "category": "Low Light",
    "price": 25,
    "rating": 4.6,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "The ZZ Plant (*Zamioculcas zamiifolia*) is arguably one of the most extremely resilient and forgiving indoor plants available, earning a reputation for near-indestructibility, making it perfect for beginners or those with busy schedules. It is famously adapted to thrive even in remarkably low-light conditions, which is a feature rarely found in other houseplants, allowing it to flourish in deep offices, shaded apartments, or forgotten corners. The plant boasts elegant, upright stalks with glossy, dark green, and almost waxy leaves that maintain a fresh look with minimal attention. Its thick, potato-like rhizomes below the soil store water, which is why it requires infrequent watering, tolerating neglect better than overwatering. This hardiness makes it an ideal, low-maintenance, and stylish choice for virtually any interior setting, adding a refined, structural green presence without demanding your constant attention.",
    "image": "https://i.postimg.cc/h4Ytwf9Z/ZZ-Plant-in-200mm-pot-Photoroom.png",
    "providerName": "GreenHaven"
  },
  {
    "plantId": 5,
    "plantName": "Pothos",
    "category": "Trailing",
    "price": 15,
    "rating": 4.9,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "The Pothos (*Epipremnum aureum*), often called Devil's Ivy, is a hugely popular and exceptionally easy-to-care-for trailing plant cherished for its lovely, characteristic heart-shaped leaves and impressively fast growth rate. This plant is remarkably versatile in terms of light, successfully growing in conditions ranging from low-light to bright indirect light, though brighter conditions will encourage more striking variegation if present. Its beautiful vines can cascade dramatically from hanging baskets, trail elegantly across shelves and bookcases, or be trained to climb a wall or support structure, offering flexible decorative options for any room. The Pothos is also recognized as an excellent natural air purifier, helping to filter airborne toxins. Its sheer resilience and adaptability make it a must-have for novice plant owners and a classic staple for green enthusiasts looking to add beautiful, flowing greenery to their home.",
    "image": "https://i.postimg.cc/VN4YF6sz/Golden-Pothos-Easy-Care-Indoor-Plant-with-Air-Purifying-Variegated-Foliage-Live-Indoor-Plant.png",
    "providerName": "LeafyHomes"
  },
  {
    "plantId": 6,
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": 28,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Peace Lily (*Spathiphyllum*) is an incredibly graceful and sought-after indoor plant known for its striking contrast between deep, glossy, dark-green leaves and its signature elegant white blooms (which are modified leaves or spathes). This plant is a powerful symbol of peace and comfort, making it a popular gift and a fantastic addition to any living space. It is highly valued as a superb natural air purifier, effectively filtering harmful volatile organic compounds from the air. The Peace Lily is notably easy to care for and thrives in medium to low light, often being one of the few flowering plants that perform well away from direct sun. A key feature is its dramatic wilting when thirsty, providing a clear, unmistakable signal that it's time to water, which simplifies the care routine. It brings a calming, sophisticated aesthetic to any home or office.",
    "image": "https://i.postimg.cc/GtRnwnm4/Peace-Lilly-in-a-pot-white-background-Photoroom.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 7,
    "plantName": "Rubber Plant",
    "category": "Decorative",
    "price": 40,
    "rating": 4.7,
    "availableStock": 7,
    "careLevel": "Moderate",
    "description": "The Rubber Plant (*Ficus elastica*) is a magnificent, resilient, and enduring choice for a houseplant, instantly serving as a bold, sculptural statement piece in any contemporary interior. It is celebrated for its broad, thick, and highly shiny leaves, which can range in color from a deep green to a rich burgundy, adding a layer of sophisticated color and texture to your decor. Given the right conditions, this plant has the potential to grow quite tall indoors, resembling a substantial, structural tree over time. It prefers to be placed in an area that receives bright, indirect light to maintain its vibrant leaf coloration and vigorous growth. A routine of regular watering is necessary, ensuring the topsoil dries out between waterings. The Rubber Plant offers a wonderful, modern, and tropical vibe, making it a fantastic centerpiece for large living areas or a striking anchor for a bright reading nook.",
    "image": "https://i.postimg.cc/c184Yd3Z/Ficus-elastica-Robusta-Rubber-Plant-Photoroom.png",
    "providerName": "GreenHaven"
  },
  {
    "plantId": 8,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 12,
    "rating": 4.9,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "The Spider Plant (*Chlorophytum comosum*) is a classic, exceptionally easy-to-grow, and highly adaptable indoor plant, making it a beloved choice for plant enthusiasts of all skill levels. It is recognized by its signature long, arching, grass-like leaves, often variegated with white stripes, and its charming habit of producing small white flowers that quickly mature into 'plantlets' or 'spiders'—miniature versions of the parent plant that are simple to propagate. The plant is celebrated for its effectiveness as an air purifier, diligently removing common indoor air pollutants. Its trailing nature makes it absolutely perfect for display in hanging baskets where the 'spiders' can dangle freely, or for adding decorative flair to shelves and elevated pots. It is highly forgiving of minimal care and various light conditions, thriving exceptionally well even when slightly neglected, making it a truly resilient green companion.",
    "image": "https://i.postimg.cc/9MwVGBrs/Chlorophytum-Variegatum-Spider-Plant-12-x-35cm-Air-Purifying-Easy-Care-Pet-Safe-Trailing-Indoor.png",
    "providerName": "LeafyHomes"
  },
  {
    "plantId": 9,
    "plantName": "Calathea Orbifolia",
    "category": "Tropical",
    "price": 50,
    "rating": 4.6,
    "availableStock": 4,
    "careLevel": "Moderate",
    "description": "The Calathea Orbifolia is an absolute showstopper from the 'Prayer Plant' family, and it is highly prized for its dramatic, large, perfectly round leaves that are uniquely patterned with beautiful, silvery-green stripes that radiate from the center. Its exquisite foliage makes it a true collector's item and a centerpiece for anyone who adores tropical, visually intricate decor. As a tropical native, this plant prefers bright, indirect light and absolutely thrives in conditions of high humidity, making it a perfect addition to a well-lit bathroom or a spot with a humidifier. Consistent moisture, without letting it become waterlogged, is key to its health. The stunning patterns and graceful movement of its leaves (they slightly close up at night) create a vibrant, dynamic, and luxurious focal point in any sophisticated indoor jungle setting.",
    "image": "https://i.postimg.cc/B6F98QVw/download-2-Photoroom.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 10,
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": 20,
    "rating": 4.8,
    "availableStock": 14,
    "careLevel": "Easy",
    "description": "The Aloe Vera is a timeless and instantly recognizable succulent, distinguished by its thick, fleshy, spear-like leaves that are filled with a clear, gelatinous sap. This sap is famous for its natural soothing and healing properties, providing relief for minor burns and skin irritations, which makes the plant not only beautiful but highly functional to keep in your home or kitchen. As a desert-adapted plant, it is incredibly hardy and resilient, thriving in spots that receive bright, indirect sunlight and requiring only minimal, infrequent watering—it is essential to let the soil dry out completely between waterings to prevent root rot. The Aloe Vera adds a clean, architectural, and robust green texture to any windowsill, desk, or shelf, offering a superb combination of both aesthetic appeal and practical, medicinal functionality with minimal effort.",
    "image": "https://i.postimg.cc/7hNR7CMS/Avoid-these-8-common-mistakes-to-keep-your-aloe-vera-plants-thriving-Photoroom.png",
    "providerName": "GreenHaven"
  },
  {
    "plantId": 11,
    "plantName": "Dracaena Marginata",
    "category": "Decorative",
    "price": 32,
    "rating": 4.7,
    "availableStock": 9,
    "careLevel": "Moderate",
    "description": "The Dracaena Marginata, widely known as the Dragon Tree, is a wonderfully distinctive and strikingly elegant indoor plant prized for its slim, often curving, woody canes topped with dramatic clusters of spiky, narrow leaves that are typically edged in a rich red or pink margin. This plant's tall, slender silhouette instantly lends a bold, modern, and vertical aesthetic to any space, effortlessly complementing contemporary and minimalist decor styles. It performs best in a location with medium, indirect light, making it quite adaptable to various indoor settings. While its care level is moderate, it's generally low-maintenance, requiring the soil to dry out a bit between waterings. The Dracaena Marginata is also a recognized air-purifying champion, making it a fantastic choice for those looking to add a stylish, easy-to-care-for plant that contributes to a cleaner indoor environment.",
    "image": "https://i.postimg.cc/BbZgrmHy/Large-Dracaena-Marginata-Large-Houseplants-for-Delivery-Photoroom.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 12,
    "plantName": "Boston Fern",
    "category": "Air Purifier",
    "price": 22,
    "rating": 4.5,
    "availableStock": 6,
    "careLevel": "Moderate",
    "description": "The Boston Fern (*Nephrolepis exaltata*) is an incredibly popular and timeless houseplant that is prized for its abundant, graceful, and arching fronds that bring a soft, lush cascade of greenery and an immediate fresh, verdant feel to any space. It is a renowned natural air-purifying powerhouse, highly effective at humidifying the air and removing toxins, which is a major benefit for indoor air quality. As a tropical plant, it prefers a higher level of humidity and indirect sunlight, making it perfectly suited for placement in naturally humid areas like bathrooms and kitchens, or on a covered patio. While not difficult to care for, its 'moderate' rating comes from its need for consistent moisture—it should not be allowed to dry out completely. Its classic, full shape looks spectacular in pedestal planters or hanging baskets, providing a timeless, delicate texture.",
    "image": "https://i.postimg.cc/TYDLRr0s/BOSTON-FERN-Photoroom.png",
    "providerName": "LeafyHomes"
  },
  {
    "plantId": 13,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 27,
    "rating": 4.8,
    "availableStock": 11,
    "careLevel": "Easy",
    "description": "The Jade Plant (*Crassula ovata*) is a highly popular and incredibly long-living succulent beloved for its distinctive, tree-like appearance, its thick, woody stems, and its signature plump, glossy, deep-green, oval-shaped leaves. Throughout Asia, this plant is steeped in cultural significance as it is often referred to as the 'Money Plant' or 'Friendship Tree' and is widely believed to bring good fortune, prosperity, and financial luck to its owner. Its compact, sculptural form makes it absolutely perfect for adding a touch of green to small spaces, such as desks, windowsills, or accent tables. As an easy-care succulent, it is exceptionally drought-tolerant, requiring minimal watering, but it does need a location with plenty of bright light to maintain its compact growth habit and flourish into a beautiful miniature tree over the years. This plant is a fantastic, resilient green gift with a lovely symbolic meaning.",
    "image": "https://i.postimg.cc/pdwVc7NG/7-Tactics-To-Grow-Jade-Plant-From-Cuttings-Photoroom.png",
    "providerName": "GreenHaven"
  },
  {
    "plantId": 14,
    "plantName": "Anthurium",
    "category": "Flowering",
    "price": 38,
    "rating": 4.7,
    "availableStock": 5,
    "careLevel": "Moderate",
    "description": "The Anthurium is a stunning and eye-catching tropical plant celebrated for its impressive ability to produce long-lasting, glossy, heart-shaped 'flowers' (actually modified leaves called spathes) in vibrant shades, most notably a dazzling lipstick red. These vibrant blooms, coupled with its dark, rich green foliage, instantly inject a pop of exotic color and a touch of sleek elegance into any indoor setting, providing a continuous display of cheerfulness. It is an excellent choice for a houseplant that offers year-round color. The Anthurium thrives beautifully in bright, indirect light and appreciates slightly humid conditions to keep its leaves and blooms looking their best. While its care is moderate, it's a rewarding plant that prefers to be kept consistently moist but never soggy. Place it on a kitchen counter or a bright side table for an instant modern, sophisticated, and tropical flair that draws the eye.",
    "image": "https://i.postimg.cc/Twjx73JW/download-3-Photoroom.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 15,
    "plantName": "Variegated Monstera",
    "category": "Foliage",
    "price": 120,
    "rating": 4.95,
    "availableStock": 5,
    "careLevel": "Moderate",
    "description": "The Variegated Monstera (*Monstera deliciosa 'Albo Variegata'*) is a truly rare, highly coveted, and luxury indoor plant, representing the pinnacle of collectible houseplant trends, and it's celebrated globally for its sheer beauty. It is distinguished by its huge, sculptural, heart-shaped leaves that are beautifully and unpredictably adorned with striking splashes and sectors of pure white and creamy-white variegation interspersed with the classic deep green. This plant commands attention, thriving best in a location with bright, diffused indirect light; this light is absolutely crucial for maintaining the brilliant white sections of its foliage. It requires moderate, careful watering—allow the top soil to dry between waterings—and appreciates slightly higher humidity. As an ultimate statement piece, the Variegated Monstera adds instant unmatched elegance and a tropical, gallery-like sophistication to any living space, turning your home into a beautiful, living piece of art that continuously evolves.",
    "image": "https://i.postimg.cc/3JsLRFTp/Monstera-Deliciosa-Variegata-Super-White-Ein-exklusiver-Hingucker-Photoroom.png",
    "providerName": "LeafyHomes"
  }
]